[
    {
        "title": "NASA's Curiosity Takes Selfie With 'Mary Anning' on the Red Planet",
        "preview": "The Mars rover has drilled three samples of rock in this clay-enriched region since arriving in July."
    },
    {
        "title": "A New Video Captures the Science of NASA's Perseverance Mars Rover",
        "preview": "With a targeted launch date of July 30, the next robotic scientist NASA is sending to the to the Red Planet has big ambitions."
    },
    {
        "title": "NASA Moves Forward With Campaign to Return Mars Samples to Earth",
        "preview": "During this next phase, the program will mature critical technologies and make critical design decisions as well as assess industry partnerships."
    },
    {
        "title": "Virginia Middle School Student Earns Honor of Naming NASA's Next Mars Rover",
        "preview": "NASA chose a seventh-grader from Virginia as winner of the agency's \"Name the Rover\" essay contest. Alexander Mather's entry for \"Perseverance\" was voted tops among 28,000 entries. "
    },
    {
        "title": "NASA's Mars 2020 Rover Goes Coast-to-Coast to Prep for Launch",
        "preview": "The agency's first step in returning rocks from Mars just arrived at Kennedy Space Center. The Mars 2020 team now begins readying for a launch to the Red Planet this July."
    },
    {
        "title": "Meet the People Behind NASA's Perseverance Rover",
        "preview": "These are the scientists and engineers who built NASA's next Mars rover and who will guide it to a safe landing in Jezero Crater. "
    },
    {
        "title": "MOXIE Could Help Future Rockets Launch Off Mars",
        "preview": "NASA's Perseverance rover carries a device to convert Martian air into oxygen that, if produced on a larger scale, could be used not just for breathing, but also for fuel."
    },
    {
        "title": "From JPL's Mailroom to Mars and Beyond",
        "preview": "Bill Allen has thrived as the mechanical systems design lead for three Mars rover missions, but he got his start as a teenager sorting letters for the NASA center."
    },
    {
        "title": "NASA's Perseverance Rover Will Peer Beneath Mars' Surface ",
        "preview": "The agency's newest rover will use the first ground-penetrating radar instrument on the Martian surface to help search for signs of past microbial life. "
    },
    {
        "title": "New Selfie Shows Curiosity, the Mars Chemist",
        "preview": "The NASA rover performed a special chemistry experiment at the location captured in its newest self-portrait."
    },
    {
        "title": "NASA Wins 4 Webbys, 4 People's Voice Awards",
        "preview": "Winners include the JPL-managed \"Send Your Name to Mars\" campaign, NASA's Global Climate Change website and Solar System Interactive."
    },
    {
        "title": "Hear Audio From NASA's Perseverance As It Travels Through Deep Space",
        "preview": "The first to be rigged with microphones, the agency's latest Mars rover picked up the subtle sounds of its own inner workings during interplanetary flight."
    },
    {
        "title": "Air Deliveries Bring NASA's Perseverance Mars Rover Closer to Launch",
        "preview": "A NASA Wallops Flight Facility cargo plane transported more than two tons of equipment — including the rover's sample collection tubes — to Florida for this summer's liftoff."
    },
    {
        "title": "Alabama High School Student Names NASA's Mars Helicopter",
        "preview": "Vaneeza Rupani's essay was chosen as the name for the small spacecraft, which will mark NASA's first attempt at powered flight on another planet."
    },
    {
        "title": "Celebrate Mars Reconnaissance Orbiter's Views From Above",
        "preview": "Marking its 15th anniversary since launch, one of the oldest spacecraft at the Red Planet has provided glimpses of dust devils, avalanches, and more."
    }
]