{"NASA's MAVEN Explores Mars to Understand Radio Interference at Earth": "NASA’s MAVEN spacecraft has discovered “layers” and “rifts” in the electrically charged part of the upper atmosphere of Mars.", "Global Storms on Mars Launch Dust Towers Into the Sky": "A Mars Dust Tower Stands Out Dust storms are common on Mars. But every decade or so, something unpredictable happens: a series of runaway storms break out, covering the entire planet in a dusty haze.", "NASA Wins 4 Webbys, 4 People's Voice Awards": "Winners include the JPL-managed \"Send Your Name to Mars\" campaign, NASA's Global Climate Change website and Solar System Interactive.", "A Martian Roundtrip: NASA's Perseverance Rover Sample Tubes": "Marvels of engineering, the rover's sample tubes must be tough enough to safely bring Red Planet samples on the long journey back to Earth in immaculate condition. ", "NASA's Mars Rover Drivers Need Your Help": "Using an online tool to label Martian terrain types, you can train an artificial intelligence algorithm that could improve the way engineers guide the Curiosity rover.", "NASA's Mars 2020 Heads Into the Test Chamber": "In this time-lapse video taken at JPL, engineers move the Mars 2020 rover into a large vacuum chamber for testing in Mars-like environmental conditions.", "Mars 2020 Stands on Its Own Six Wheels": "In time-lapse video, taken at JPL, captures the first time NASA's Mars 2020 rover carries its full weight on its legs and wheels.", "NASA's Perseverance Mars Rover Gets Balanced": "The mission team performed a crucial weight-balancing test on the rover in preparation for this summer's history-making launch to the Red Planet.", "NASA's Curiosity Takes Selfie With 'Mary Anning' on the Red Planet": "The Mars rover has drilled three samples of rock in this clay-enriched region since arriving in July.", "How NASA's Mars Helicopter Will Reach the Red Planet's Surface": "The small craft will seek to prove that powered, controlled flight is possible on another planet. But just getting it onto the surface of Mars will take a whole lot of ingenuity.", "Mars Scientists Investigate Ancient Life in Australia": "Teams with NASA's Mars 2020 and ESA's ExoMars practiced hunting for fossilized microbial life in the Australian Outback in preparation for their Red Planet missions. ", "NASA, ULA Launch Mars 2020 Perseverance Rover Mission to Red Planet": "The agency's Mars 2020 mission is on its way. It will land at Jezero Crater in about seven months, on Feb. 18, 2021. ", "NASA's Mars 2020 Rover Closer to Getting Its Name": "155 students from across the U.S. have been chosen as semifinalists in NASA's essay contest to name the Mars 2020 rover, and see it launch from Cape Canaveral this July.", "NASA's Mars 2020 Will Hunt for Microscopic Fossils": "A new paper identifies a ring of minerals at the rover's landing site that are ideal for fossilizing microbial life.", "The Man Who Wanted to Fly on Mars": "The Mars Helicopter is riding to the Red Planet this summer with NASA's Perseverance rover. The helicopter's chief engineer, Bob Balaram, shares the saga of how it came into being."}